app/views/home/index.html.erb


<%= pluralize User.logged_in.count, "user" %> currently logged in<br /> <!-- This based on last_request_at, if they were active < 10 minutes they are logged in -->
---
SELECT COUNT(*) FROM "users" WHERE (last_request_at > '2011-12-16 18:32:31.135789')